ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_romapi_patch.c
//HBN

/****************************************************************************/ /**
 * @brief  Power on XTAL 32K
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION HBN_Power_On_Xtal_32K(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(HBN_BASE, HBN_XTAL32K);
    tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_XTAL32K_HIZ_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, HBN_PU_XTAL32K);
    tmpVal = BL_SET_REG_BIT(tmpVal, HBN_PU_XTAL32K_BUF);
    BL_WR_REG(HBN_BASE, HBN_XTAL32K, tmpVal);

    /* Delay >1s */
    arch_delay_us(1100);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Power off XTAL 32K
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION HBN_Power_Off_Xtal_32K(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(HBN_BASE, HBN_XTAL32K);
    tmpVal = BL_SET_REG_BIT(tmpVal, HBN_XTAL32K_HIZ_EN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_PU_XTAL32K);
    tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_PU_XTAL32K_BUF);
    BL_WR_REG(HBN_BASE, HBN_XTAL32K, tmpVal);

    return SUCCESS;
}

/**
 * @brief Power Off RC32K in all state
 *
 * @return BL_Err_Type
 */
BL_Err_Type ATTR_CLOCK_SECTION HBN_PD_RC32K_All_State(void)
{
    int32_t tmpVal = 0;

    tmpVal = BL_RD_REG(HBN_BASE, HBN_RTC_RST_CTRL2);
    tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_REG_EN_HW_PU_RC32K);
    BL_WR_REG(HBN_BASE, HBN_RTC_RST_CTRL2, tmpVal);
    HBN_Power_Off_RC32K();
    return SUCCESS;
}

/**
 * @brief Power Off RC32K In power off state
 *
 * @return BL_Err_Type
 */
BL_Err_Type ATTR_CLOCK_SECTION HBN_PD_RC32K_In_Poff(void)
{
    int32_t tmpVal = 0;

    tmpVal = BL_RD_REG(HBN_BASE, HBN_RTC_RST_CTRL2);
    tmpVal = BL_SET_REG_BIT(tmpVal, HBN_REG_EN_HW_PU_RC32K);
    BL_WR_REG(HBN_BASE, HBN_RTC_RST_CTRL2, tmpVal);
    HBN_Power_Off_RC32K();
    return SUCCESS;
}

/****************************************************************************
 * @brief  HBN set ldo11_Rtc voltage out
 *
 * @param  ldoLevel: LDO11_Rtc volatge level
 *        0:0.60V  1:0.65V  2:0.70V  3:0.75V
 *        4:0.80V  5:0.85V  6:0.9V   7:0.95V
 *        8:1.0V   9:1.05V  10:1.1V  11:1.15V,
 *        12:1.2V  13:1.25V  14:1.3V 15:1.35V
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION HBN_Set_Ldo11_Rtc_Vout(HBN_LDO_LEVEL_Type ldoLevel)
{
    HBN_RTC_MISC_Type rtcMiscCfg;

    CHECK_PARAM(IS_HBN_LDO_LEVEL_TYPE(ldoLevel));

    HBN_Get_RTC_Misc_Cfg(&rtcMiscCfg);
    rtcMiscCfg.ldo11RtcVoutSelRtc = ldoLevel;
    HBN_Set_RTC_Misc_Cfg(&rtcMiscCfg);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  HBN set ldo11 all voltage out, not include dcdc11
 *
 * @param  ldoLevel: LDO volatge level
 *
 * @return SUCCESS or ERROR
 *
 * @note not support LDO11_Rtc 0.65v & 0.6v
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION HBN_Set_Ldo11_All_Vout(HBN_LDO_LEVEL_Type ldoLevel)
{
    uint32_t tmpVal;
    HBN_RTC_MISC_Type rtcMiscCfg;

    CHECK_PARAM(IS_HBN_LDO_LEVEL_TYPE(ldoLevel));

    tmpVal = BL_RD_REG(HBN_BASE, HBN_GLB);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_SW_LDO11_AON_VOUT_SEL, ldoLevel);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_SW_LDO11_RT_VOUT_SEL, ldoLevel);
    BL_WR_REG(HBN_BASE, HBN_GLB, tmpVal);

    HBN_Get_RTC_Misc_Cfg(&rtcMiscCfg);
    rtcMiscCfg.ldo11RtcVoutSelRtc = ldoLevel;
    HBN_Set_RTC_Misc_Cfg(&rtcMiscCfg);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Get RTC misc config
 *
 * @param  cfg: configuration
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION HBN_Get_RTC_Misc_Cfg(HBN_RTC_MISC_Type *cfg)
{
    uint32_t tmpVal = 0;
    uint32_t *pCfg = (uint32_t *)cfg;

    if (!cfg) {
        return ERROR;
    }

    /* read [31:19] */
    tmpVal = BL_RD_REG(HBN_BASE, HBN_RTC_RST_CTRL);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, HBN_RTC_RST_CTRL_MISC);

    /* use [30:19] */
    *pCfg = tmpVal;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set RTC misc config
 *
 * @param  cfg: configuration
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION HBN_Set_RTC_Misc_Cfg(HBN_RTC_MISC_Type *cfg)
{
    uint32_t tmpVal = 0;

    if (!cfg) {
        return ERROR;
    }

    /* read [31:19] */
    tmpVal = BL_RD_REG(HBN_BASE, HBN_RTC_RST_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_RTC_RST_CTRL_MISC, ((*(uint32_t *)cfg)<<1));
    BL_WR_REG(HBN_BASE, HBN_RTC_RST_CTRL, tmpVal);

    return SUCCESS;
}

//AON
/****************************************************************************/ /**
 * @brief  AON set DCDC11_Top voltage out
 *
 * @param  dcdcLevel: DCDC11_Top volatge level
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION AON_Set_DCDC11_Top_Vout(AON_DCDC_LEVEL_Type dcdcLevel)
{
    uint32_t tmpVal;

    CHECK_PARAM(IS_AON_DCDC_LEVEL_TYPE(dcdcLevel));

    tmpVal = BL_RD_REG(AON_BASE, AON_DCDC_TOP_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_DCDC11_VOUT_SEL_AON, dcdcLevel);
    BL_WR_REG(AON_BASE, AON_DCDC_TOP_0, tmpVal);

    return SUCCESS;
}
/****************************************************************************/ /**
 * @brief      delay us
 *
 * @param[in]  core:  systemcoreclock
 *
 * @param[in]  cnt:  delay cnt us
 *
 * @return none
 *
 *******************************************************************************/
void ATTR_TCM_SECTION ASM_Delay_Us(uint32_t core, uint32_t cnt, uint32_t loopT)
{
    volatile uint32_t divVal = loopT;
    volatile uint32_t speed = 0;
    volatile uint32_t cycNum = 0;

    /* 1M=100K*10, so multiple is 10 */
    /* loop function take 4 instructions, so instructionNum is 4 */
    /* divVal = multiple*instructionNum */

    if (core >= 1 * 1000 * 1000) {
        /* CPU clock >= 1MHz */
        speed = core / (100 * 1000);
        cycNum = speed * cnt;
        cycNum = cycNum / 10;
        cycNum = cycNum / divVal;
        /* cycNum >= 0 */
    } else {
        /* CPU clock < 1MHz */
        speed = core / 1000;
        cycNum = speed * cnt;
        cycNum = cycNum / 1000;
        cycNum = cycNum / divVal;
        /* cycNum >= 0 */
    }

    if (!cycNum) {
        return;
    }

    __asm__ __volatile__(
        "mv       a4,%0\n\t"
        "li       a5,0x0\n\t"
        "nop\n\t"
        "nop\n\t"
        "nop\n\t"
        ".align 4\n\t"
        "1  :\n"
        "beq      a5,a4,2f\n\t"
        "addi     a5,a5,0x1\n\t"
        "lui      a3,0xF0000\n\t"
        "lw       a3,0(a3)\n\t"
        "j        1b\n\t"
        "nop\n\t"
        "nop\n\t"
        "2   :\n\t"
        "nop\n"
        :                  /* output */
        : "r"(cycNum)      /* input */
        : "a3", "a4", "a5" /* destruct description */
    );
}

/****************************************************************************/ /**
 * @brief      delay us
 *
 * @param[in]  cnt:  delay cnt us
 *
 * @return none
 *
 *******************************************************************************/
void ATTR_TCM_SECTION arch_delay_us(uint32_t cnt)
{
    GLB_CORE_ID_Type coreID;
    uint32_t coreFreq;
    uint32_t loopTick = 5;
    uint32_t m0Cyc00[] = { 46, 46, 77, 85 };
    uint32_t m0Cyc10[] = { 10, 10, 77, 85 };
    uint32_t m0Cyc11[] = { 10, 10, 77, 85 };
    uint32_t d0Cyc00[] = { 5, 5, 62, 34 };
    uint32_t d0Cyc11[] = { 5, 5, 13, 13 };
    uint32_t lpCyc00[] = { 6, 6, 55, 85 };
    uint32_t *pCyc = NULL;
    uint32_t iCacheEn = 1;
    uint32_t dCacheEn = 1;

    /* requirement: icache enable && dcache enable */
    /* otherwise the latency depends on the code address */

